GopalSaraf/Practicals/PSDL/include/proc/pic16f18856.inc
// Register: SCANHADRH
#define SCANHADRH SCANHADRH
SCANHADRH                                equ 040Fh
// bitfield definitions
SCANHADRH_HADRH_POSN                     equ 0000h
SCANHADRH_HADRH_POSITION                 equ 0000h
SCANHADRH_HADRH_SIZE                     equ 0008h
SCANHADRH_HADRH_LENGTH                   equ 0008h
SCANHADRH_HADRH_MASK                     equ 00FFh
SCANHADRH_HADR8_POSN                     equ 0000h
SCANHADRH_HADR8_POSITION                 equ 0000h
SCANHADRH_HADR8_SIZE                     equ 0001h
SCANHADRH_HADR8_LENGTH                   equ 0001h
SCANHADRH_HADR8_MASK                     equ 0001h
SCANHADRH_HADR9_POSN                     equ 0001h
SCANHADRH_HADR9_POSITION                 equ 0001h
SCANHADRH_HADR9_SIZE                     equ 0001h
SCANHADRH_HADR9_LENGTH                   equ 0001h
SCANHADRH_HADR9_MASK                     equ 0002h
SCANHADRH_HADR10_POSN                    equ 0002h
SCANHADRH_HADR10_POSITION                equ 0002h
SCANHADRH_HADR10_SIZE                    equ 0001h
SCANHADRH_HADR10_LENGTH                  equ 0001h
SCANHADRH_HADR10_MASK                    equ 0004h
SCANHADRH_HADR11_POSN                    equ 0003h
SCANHADRH_HADR11_POSITION                equ 0003h
SCANHADRH_HADR11_SIZE                    equ 0001h
SCANHADRH_HADR11_LENGTH                  equ 0001h
SCANHADRH_HADR11_MASK                    equ 0008h
SCANHADRH_HADR12_POSN                    equ 0004h
SCANHADRH_HADR12_POSITION                equ 0004h
SCANHADRH_HADR12_SIZE                    equ 0001h
SCANHADRH_HADR12_LENGTH                  equ 0001h
SCANHADRH_HADR12_MASK                    equ 0010h
SCANHADRH_HADR13_POSN                    equ 0005h
SCANHADRH_HADR13_POSITION                equ 0005h
SCANHADRH_HADR13_SIZE                    equ 0001h
SCANHADRH_HADR13_LENGTH                  equ 0001h
SCANHADRH_HADR13_MASK                    equ 0020h
SCANHADRH_HADR14_POSN                    equ 0006h
SCANHADRH_HADR14_POSITION                equ 0006h
SCANHADRH_HADR14_SIZE                    equ 0001h
SCANHADRH_HADR14_LENGTH                  equ 0001h
SCANHADRH_HADR14_MASK                    equ 0040h
SCANHADRH_HADR15_POSN                    equ 0007h
SCANHADRH_HADR15_POSITION                equ 0007h
SCANHADRH_HADR15_SIZE                    equ 0001h
SCANHADRH_HADR15_LENGTH                  equ 0001h
SCANHADRH_HADR15_MASK                    equ 0080h
SCANHADRH_SCANHADRH_POSN                 equ 0000h
SCANHADRH_SCANHADRH_POSITION             equ 0000h
SCANHADRH_SCANHADRH_SIZE                 equ 0008h
SCANHADRH_SCANHADRH_LENGTH               equ 0008h
SCANHADRH_SCANHADRH_MASK                 equ 00FFh
SCANHADRH_SCANHADR8_POSN                 equ 0000h
SCANHADRH_SCANHADR8_POSITION             equ 0000h
SCANHADRH_SCANHADR8_SIZE                 equ 0001h
SCANHADRH_SCANHADR8_LENGTH               equ 0001h
SCANHADRH_SCANHADR8_MASK                 equ 0001h
SCANHADRH_SCANHADR9_POSN                 equ 0001h
SCANHADRH_SCANHADR9_POSITION             equ 0001h
SCANHADRH_SCANHADR9_SIZE                 equ 0001h
SCANHADRH_SCANHADR9_LENGTH               equ 0001h
SCANHADRH_SCANHADR9_MASK                 equ 0002h
SCANHADRH_SCANHADR10_POSN                equ 0002h
SCANHADRH_SCANHADR10_POSITION            equ 0002h
SCANHADRH_SCANHADR10_SIZE                equ 0001h
SCANHADRH_SCANHADR10_LENGTH              equ 0001h
SCANHADRH_SCANHADR10_MASK                equ 0004h
SCANHADRH_SCANHADR11_POSN                equ 0003h
SCANHADRH_SCANHADR11_POSITION            equ 0003h
SCANHADRH_SCANHADR11_SIZE                equ 0001h
SCANHADRH_SCANHADR11_LENGTH              equ 0001h
SCANHADRH_SCANHADR11_MASK                equ 0008h
SCANHADRH_SCANHADR12_POSN                equ 0004h
SCANHADRH_SCANHADR12_POSITION            equ 0004h
SCANHADRH_SCANHADR12_SIZE                equ 0001h
SCANHADRH_SCANHADR12_LENGTH              equ 0001h
SCANHADRH_SCANHADR12_MASK                equ 0010h
SCANHADRH_SCANHADR13_POSN                equ 0005h
SCANHADRH_SCANHADR13_POSITION            equ 0005h
SCANHADRH_SCANHADR13_SIZE                equ 0001h
SCANHADRH_SCANHADR13_LENGTH              equ 0001h
SCANHADRH_SCANHADR13_MASK                equ 0020h
SCANHADRH_SCANHADR14_POSN                equ 0006h
SCANHADRH_SCANHADR14_POSITION            equ 0006h
SCANHADRH_SCANHADR14_SIZE                equ 0001h
SCANHADRH_SCANHADR14_LENGTH              equ 0001h
SCANHADRH_SCANHADR14_MASK                equ 0040h
SCANHADRH_SCANHADR15_POSN                equ 0007h
SCANHADRH_SCANHADR15_POSITION            equ 0007h
SCANHADRH_SCANHADR15_SIZE                equ 0001h
SCANHADRH_SCANHADR15_LENGTH              equ 0001h
SCANHADRH_SCANHADR15_MASK                equ 0080h

// Register: SCANCON0
#define SCANCON0 SCANCON0
SCANCON0                                 equ 0410h
// bitfield definitions
SCANCON0_MODE_POSN                       equ 0000h
SCANCON0_MODE_POSITION                   equ 0000h
SCANCON0_MODE_SIZE                       equ 0002h
SCANCON0_MODE_LENGTH                     equ 0002h
SCANCON0_MODE_MASK                       equ 0003h
SCANCON0_INTM_POSN                       equ 0003h
SCANCON0_INTM_POSITION                   equ 0003h
SCANCON0_INTM_SIZE                       equ 0001h
SCANCON0_INTM_LENGTH                     equ 0001h
SCANCON0_INTM_MASK                       equ 0008h
SCANCON0_INVALID_POSN                    equ 0004h
SCANCON0_INVALID_POSITION                equ 0004h
SCANCON0_INVALID_SIZE                    equ 0001h
SCANCON0_INVALID_LENGTH                  equ 0001h
SCANCON0_INVALID_MASK                    equ 0010h
SCANCON0_BUSY_POSN                       equ 0005h
SCANCON0_BUSY_POSITION                   equ 0005h
SCANCON0_BUSY_SIZE                       equ 0001h
SCANCON0_BUSY_LENGTH                     equ 0001h
SCANCON0_BUSY_MASK                       equ 0020h
SCANCON0_SCANGO_POSN                     equ 0006h
SCANCON0_SCANGO_POSITION                 equ 0006h
SCANCON0_SCANGO_SIZE                     equ 0001h
SCANCON0_SCANGO_LENGTH                   equ 0001h
SCANCON0_SCANGO_MASK                     equ 0040h
SCANCON0_EN_POSN                         equ 0007h
SCANCON0_EN_POSITION                     equ 0007h
SCANCON0_EN_SIZE                         equ 0001h
SCANCON0_EN_LENGTH                       equ 0001h
SCANCON0_EN_MASK                         equ 0080h
SCANCON0_MODE0_POSN                      equ 0000h
SCANCON0_MODE0_POSITION                  equ 0000h
SCANCON0_MODE0_SIZE                      equ 0001h
SCANCON0_MODE0_LENGTH                    equ 0001h
SCANCON0_MODE0_MASK                      equ 0001h
SCANCON0_MODE1_POSN                      equ 0001h
SCANCON0_MODE1_POSITION                  equ 0001h
SCANCON0_MODE1_SIZE                      equ 0001h
SCANCON0_MODE1_LENGTH                    equ 0001h
SCANCON0_MODE1_MASK                      equ 0002h
SCANCON0_SCANMODE_POSN                   equ 0000h
SCANCON0_SCANMODE_POSITION               equ 0000h
SCANCON0_SCANMODE_SIZE                   equ 0002h
SCANCON0_SCANMODE_LENGTH                 equ 0002h
SCANCON0_SCANMODE_MASK                   equ 0003h
SCANCON0_SCANINTM_POSN                   equ 0003h
SCANCON0_SCANINTM_POSITION               equ 0003h
SCANCON0_SCANINTM_SIZE                   equ 0001h
SCANCON0_SCANINTM_LENGTH                 equ 0001h
SCANCON0_SCANINTM_MASK                   equ 0008h
SCANCON0_SCANINVALID_POSN                equ 0004h
SCANCON0_SCANINVALID_POSITION            equ 0004h
SCANCON0_SCANINVALID_SIZE                equ 0001h
SCANCON0_SCANINVALID_LENGTH              equ 0001h
SCANCON0_SCANINVALID_MASK                equ 0010h
SCANCON0_SCANBUSY_POSN                   equ 0005h
SCANCON0_SCANBUSY_POSITION               equ 0005h
SCANCON0_SCANBUSY_SIZE                   equ 0001h
SCANCON0_SCANBUSY_LENGTH                 equ 0001h
SCANCON0_SCANBUSY_MASK                   equ 0020h
SCANCON0_SCANEN_POSN                     equ 0007h
SCANCON0_SCANEN_POSITION                 equ 0007h
SCANCON0_SCANEN_SIZE                     equ 0001h
SCANCON0_SCANEN_LENGTH                   equ 0001h
SCANCON0_SCANEN_MASK                     equ 0080h
SCANCON0_SCANMODE0_POSN                  equ 0000h
SCANCON0_SCANMODE0_POSITION              equ 0000h
SCANCON0_SCANMODE0_SIZE                  equ 0001h
SCANCON0_SCANMODE0_LENGTH                equ 0001h
SCANCON0_SCANMODE0_MASK                  equ 0001h
SCANCON0_SCANMODE1_POSN                  equ 0001h
SCANCON0_SCANMODE1_POSITION              equ 0001h
SCANCON0_SCANMODE1_SIZE                  equ 0001h
SCANCON0_SCANMODE1_LENGTH                equ 0001h
SCANCON0_SCANMODE1_MASK                  equ 0002h
SCANCON0_DABORT_POSN                     equ 0004h
SCANCON0_DABORT_POSITION                 equ 0004h
SCANCON0_DABORT_SIZE                     equ 0001h
SCANCON0_DABORT_LENGTH                   equ 0001h
SCANCON0_DABORT_MASK                     equ 0010h

