GopalSaraf/Practicals/PSDL/include/proc/pic16f18856.inc
// Register: SMT1CPWU
#define SMT1CPWU SMT1CPWU
SMT1CPWU                                 equ 0494h
// bitfield definitions
SMT1CPWU_CPW_POSN                        equ 0000h
SMT1CPWU_CPW_POSITION                    equ 0000h
SMT1CPWU_CPW_SIZE                        equ 0008h
SMT1CPWU_CPW_LENGTH                      equ 0008h
SMT1CPWU_CPW_MASK                        equ 00FFh
SMT1CPWU_CPW16_POSN                      equ 0000h
SMT1CPWU_CPW16_POSITION                  equ 0000h
SMT1CPWU_CPW16_SIZE                      equ 0001h
SMT1CPWU_CPW16_LENGTH                    equ 0001h
SMT1CPWU_CPW16_MASK                      equ 0001h
SMT1CPWU_CPW17_POSN                      equ 0001h
SMT1CPWU_CPW17_POSITION                  equ 0001h
SMT1CPWU_CPW17_SIZE                      equ 0001h
SMT1CPWU_CPW17_LENGTH                    equ 0001h
SMT1CPWU_CPW17_MASK                      equ 0002h
SMT1CPWU_CPW18_POSN                      equ 0002h
SMT1CPWU_CPW18_POSITION                  equ 0002h
SMT1CPWU_CPW18_SIZE                      equ 0001h
SMT1CPWU_CPW18_LENGTH                    equ 0001h
SMT1CPWU_CPW18_MASK                      equ 0004h
SMT1CPWU_CPW19_POSN                      equ 0003h
SMT1CPWU_CPW19_POSITION                  equ 0003h
SMT1CPWU_CPW19_SIZE                      equ 0001h
SMT1CPWU_CPW19_LENGTH                    equ 0001h
SMT1CPWU_CPW19_MASK                      equ 0008h
SMT1CPWU_CPW20_POSN                      equ 0004h
SMT1CPWU_CPW20_POSITION                  equ 0004h
SMT1CPWU_CPW20_SIZE                      equ 0001h
SMT1CPWU_CPW20_LENGTH                    equ 0001h
SMT1CPWU_CPW20_MASK                      equ 0010h
SMT1CPWU_CPW21_POSN                      equ 0005h
SMT1CPWU_CPW21_POSITION                  equ 0005h
SMT1CPWU_CPW21_SIZE                      equ 0001h
SMT1CPWU_CPW21_LENGTH                    equ 0001h
SMT1CPWU_CPW21_MASK                      equ 0020h
SMT1CPWU_CPW22_POSN                      equ 0006h
SMT1CPWU_CPW22_POSITION                  equ 0006h
SMT1CPWU_CPW22_SIZE                      equ 0001h
SMT1CPWU_CPW22_LENGTH                    equ 0001h
SMT1CPWU_CPW22_MASK                      equ 0040h
SMT1CPWU_CPW23_POSN                      equ 0007h
SMT1CPWU_CPW23_POSITION                  equ 0007h
SMT1CPWU_CPW23_SIZE                      equ 0001h
SMT1CPWU_CPW23_LENGTH                    equ 0001h
SMT1CPWU_CPW23_MASK                      equ 0080h
SMT1CPWU_SMT1CPW_POSN                    equ 0000h
SMT1CPWU_SMT1CPW_POSITION                equ 0000h
SMT1CPWU_SMT1CPW_SIZE                    equ 0008h
SMT1CPWU_SMT1CPW_LENGTH                  equ 0008h
SMT1CPWU_SMT1CPW_MASK                    equ 00FFh
SMT1CPWU_SMT1CPW16_POSN                  equ 0000h
SMT1CPWU_SMT1CPW16_POSITION              equ 0000h
SMT1CPWU_SMT1CPW16_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW16_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW16_MASK                  equ 0001h
SMT1CPWU_SMT1CPW17_POSN                  equ 0001h
SMT1CPWU_SMT1CPW17_POSITION              equ 0001h
SMT1CPWU_SMT1CPW17_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW17_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW17_MASK                  equ 0002h
SMT1CPWU_SMT1CPW18_POSN                  equ 0002h
SMT1CPWU_SMT1CPW18_POSITION              equ 0002h
SMT1CPWU_SMT1CPW18_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW18_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW18_MASK                  equ 0004h
SMT1CPWU_SMT1CPW19_POSN                  equ 0003h
SMT1CPWU_SMT1CPW19_POSITION              equ 0003h
SMT1CPWU_SMT1CPW19_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW19_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW19_MASK                  equ 0008h
SMT1CPWU_SMT1CPW20_POSN                  equ 0004h
SMT1CPWU_SMT1CPW20_POSITION              equ 0004h
SMT1CPWU_SMT1CPW20_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW20_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW20_MASK                  equ 0010h
SMT1CPWU_SMT1CPW21_POSN                  equ 0005h
SMT1CPWU_SMT1CPW21_POSITION              equ 0005h
SMT1CPWU_SMT1CPW21_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW21_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW21_MASK                  equ 0020h
SMT1CPWU_SMT1CPW22_POSN                  equ 0006h
SMT1CPWU_SMT1CPW22_POSITION              equ 0006h
SMT1CPWU_SMT1CPW22_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW22_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW22_MASK                  equ 0040h
SMT1CPWU_SMT1CPW23_POSN                  equ 0007h
SMT1CPWU_SMT1CPW23_POSITION              equ 0007h
SMT1CPWU_SMT1CPW23_SIZE                  equ 0001h
SMT1CPWU_SMT1CPW23_LENGTH                equ 0001h
SMT1CPWU_SMT1CPW23_MASK                  equ 0080h

// Register: SMT1PRL
#define SMT1PRL SMT1PRL
SMT1PRL                                  equ 0495h
// bitfield definitions
SMT1PRL_PR_POSN                          equ 0000h
SMT1PRL_PR_POSITION                      equ 0000h
SMT1PRL_PR_SIZE                          equ 0008h
SMT1PRL_PR_LENGTH                        equ 0008h
SMT1PRL_PR_MASK                          equ 00FFh
SMT1PRL_PR0_POSN                         equ 0000h
SMT1PRL_PR0_POSITION                     equ 0000h
SMT1PRL_PR0_SIZE                         equ 0001h
SMT1PRL_PR0_LENGTH                       equ 0001h
SMT1PRL_PR0_MASK                         equ 0001h
SMT1PRL_PR1_POSN                         equ 0001h
SMT1PRL_PR1_POSITION                     equ 0001h
SMT1PRL_PR1_SIZE                         equ 0001h
SMT1PRL_PR1_LENGTH                       equ 0001h
SMT1PRL_PR1_MASK                         equ 0002h
SMT1PRL_PR2_POSN                         equ 0002h
SMT1PRL_PR2_POSITION                     equ 0002h
SMT1PRL_PR2_SIZE                         equ 0001h
SMT1PRL_PR2_LENGTH                       equ 0001h
SMT1PRL_PR2_MASK                         equ 0004h
SMT1PRL_PR3_POSN                         equ 0003h
SMT1PRL_PR3_POSITION                     equ 0003h
SMT1PRL_PR3_SIZE                         equ 0001h
SMT1PRL_PR3_LENGTH                       equ 0001h
SMT1PRL_PR3_MASK                         equ 0008h
SMT1PRL_PR4_POSN                         equ 0004h
SMT1PRL_PR4_POSITION                     equ 0004h
SMT1PRL_PR4_SIZE                         equ 0001h
SMT1PRL_PR4_LENGTH                       equ 0001h
SMT1PRL_PR4_MASK                         equ 0010h
SMT1PRL_PR5_POSN                         equ 0005h
SMT1PRL_PR5_POSITION                     equ 0005h
SMT1PRL_PR5_SIZE                         equ 0001h
SMT1PRL_PR5_LENGTH                       equ 0001h
SMT1PRL_PR5_MASK                         equ 0020h
SMT1PRL_PR6_POSN                         equ 0006h
SMT1PRL_PR6_POSITION                     equ 0006h
SMT1PRL_PR6_SIZE                         equ 0001h
SMT1PRL_PR6_LENGTH                       equ 0001h
SMT1PRL_PR6_MASK                         equ 0040h
SMT1PRL_PR7_POSN                         equ 0007h
SMT1PRL_PR7_POSITION                     equ 0007h
SMT1PRL_PR7_SIZE                         equ 0001h
SMT1PRL_PR7_LENGTH                       equ 0001h
SMT1PRL_PR7_MASK                         equ 0080h
SMT1PRL_SMT1PR_POSN                      equ 0000h
SMT1PRL_SMT1PR_POSITION                  equ 0000h
SMT1PRL_SMT1PR_SIZE                      equ 0008h
SMT1PRL_SMT1PR_LENGTH                    equ 0008h
SMT1PRL_SMT1PR_MASK                      equ 00FFh
SMT1PRL_SMT1PR0_POSN                     equ 0000h
SMT1PRL_SMT1PR0_POSITION                 equ 0000h
SMT1PRL_SMT1PR0_SIZE                     equ 0001h
SMT1PRL_SMT1PR0_LENGTH                   equ 0001h
SMT1PRL_SMT1PR0_MASK                     equ 0001h
SMT1PRL_SMT1PR1_POSN                     equ 0001h
SMT1PRL_SMT1PR1_POSITION                 equ 0001h
SMT1PRL_SMT1PR1_SIZE                     equ 0001h
SMT1PRL_SMT1PR1_LENGTH                   equ 0001h
SMT1PRL_SMT1PR1_MASK                     equ 0002h
SMT1PRL_SMT1PR2_POSN                     equ 0002h
SMT1PRL_SMT1PR2_POSITION                 equ 0002h
SMT1PRL_SMT1PR2_SIZE                     equ 0001h
SMT1PRL_SMT1PR2_LENGTH                   equ 0001h
SMT1PRL_SMT1PR2_MASK                     equ 0004h
SMT1PRL_SMT1PR3_POSN                     equ 0003h
SMT1PRL_SMT1PR3_POSITION                 equ 0003h
SMT1PRL_SMT1PR3_SIZE                     equ 0001h
SMT1PRL_SMT1PR3_LENGTH                   equ 0001h
SMT1PRL_SMT1PR3_MASK                     equ 0008h
SMT1PRL_SMT1PR4_POSN                     equ 0004h
SMT1PRL_SMT1PR4_POSITION                 equ 0004h
SMT1PRL_SMT1PR4_SIZE                     equ 0001h
SMT1PRL_SMT1PR4_LENGTH                   equ 0001h
SMT1PRL_SMT1PR4_MASK                     equ 0010h
SMT1PRL_SMT1PR5_POSN                     equ 0005h
SMT1PRL_SMT1PR5_POSITION                 equ 0005h
SMT1PRL_SMT1PR5_SIZE                     equ 0001h
SMT1PRL_SMT1PR5_LENGTH                   equ 0001h
SMT1PRL_SMT1PR5_MASK                     equ 0020h
SMT1PRL_SMT1PR6_POSN                     equ 0006h
SMT1PRL_SMT1PR6_POSITION                 equ 0006h
SMT1PRL_SMT1PR6_SIZE                     equ 0001h
SMT1PRL_SMT1PR6_LENGTH                   equ 0001h
SMT1PRL_SMT1PR6_MASK                     equ 0040h
SMT1PRL_SMT1PR7_POSN                     equ 0007h
SMT1PRL_SMT1PR7_POSITION                 equ 0007h
SMT1PRL_SMT1PR7_SIZE                     equ 0001h
SMT1PRL_SMT1PR7_LENGTH                   equ 0001h
SMT1PRL_SMT1PR7_MASK                     equ 0080h

// Register: SMT1PRH
#define SMT1PRH SMT1PRH
SMT1PRH                                  equ 0496h
// bitfield definitions
SMT1PRH_PR_POSN                          equ 0000h
SMT1PRH_PR_POSITION                      equ 0000h
SMT1PRH_PR_SIZE                          equ 0008h
SMT1PRH_PR_LENGTH                        equ 0008h
SMT1PRH_PR_MASK                          equ 00FFh
SMT1PRH_PR8_POSN                         equ 0000h
SMT1PRH_PR8_POSITION                     equ 0000h
SMT1PRH_PR8_SIZE                         equ 0001h
SMT1PRH_PR8_LENGTH                       equ 0001h
SMT1PRH_PR8_MASK                         equ 0001h
SMT1PRH_PR9_POSN                         equ 0001h
SMT1PRH_PR9_POSITION                     equ 0001h
SMT1PRH_PR9_SIZE                         equ 0001h
SMT1PRH_PR9_LENGTH                       equ 0001h
SMT1PRH_PR9_MASK                         equ 0002h
SMT1PRH_PR10_POSN                        equ 0002h
SMT1PRH_PR10_POSITION                    equ 0002h
SMT1PRH_PR10_SIZE                        equ 0001h
SMT1PRH_PR10_LENGTH                      equ 0001h
SMT1PRH_PR10_MASK                        equ 0004h
SMT1PRH_PR11_POSN                        equ 0003h
SMT1PRH_PR11_POSITION                    equ 0003h
SMT1PRH_PR11_SIZE                        equ 0001h
SMT1PRH_PR11_LENGTH                      equ 0001h
SMT1PRH_PR11_MASK                        equ 0008h
SMT1PRH_PR12_POSN                        equ 0004h
SMT1PRH_PR12_POSITION                    equ 0004h
SMT1PRH_PR12_SIZE                        equ 0001h
SMT1PRH_PR12_LENGTH                      equ 0001h
SMT1PRH_PR12_MASK                        equ 0010h
SMT1PRH_PR13_POSN                        equ 0005h
SMT1PRH_PR13_POSITION                    equ 0005h
SMT1PRH_PR13_SIZE                        equ 0001h
SMT1PRH_PR13_LENGTH                      equ 0001h
SMT1PRH_PR13_MASK                        equ 0020h
SMT1PRH_PR14_POSN                        equ 0006h
SMT1PRH_PR14_POSITION                    equ 0006h
SMT1PRH_PR14_SIZE                        equ 0001h
SMT1PRH_PR14_LENGTH                      equ 0001h
SMT1PRH_PR14_MASK                        equ 0040h
SMT1PRH_PR15_POSN                        equ 0007h
SMT1PRH_PR15_POSITION                    equ 0007h
SMT1PRH_PR15_SIZE                        equ 0001h
SMT1PRH_PR15_LENGTH                      equ 0001h
SMT1PRH_PR15_MASK                        equ 0080h
SMT1PRH_SMT1PR_POSN                      equ 0000h
SMT1PRH_SMT1PR_POSITION                  equ 0000h
SMT1PRH_SMT1PR_SIZE                      equ 0008h
SMT1PRH_SMT1PR_LENGTH                    equ 0008h
SMT1PRH_SMT1PR_MASK                      equ 00FFh
SMT1PRH_SMT1PR8_POSN                     equ 0000h
SMT1PRH_SMT1PR8_POSITION                 equ 0000h
SMT1PRH_SMT1PR8_SIZE                     equ 0001h
SMT1PRH_SMT1PR8_LENGTH                   equ 0001h
SMT1PRH_SMT1PR8_MASK                     equ 0001h
SMT1PRH_SMT1PR9_POSN                     equ 0001h
SMT1PRH_SMT1PR9_POSITION                 equ 0001h
SMT1PRH_SMT1PR9_SIZE                     equ 0001h
SMT1PRH_SMT1PR9_LENGTH                   equ 0001h
SMT1PRH_SMT1PR9_MASK                     equ 0002h
SMT1PRH_SMT1PR10_POSN                    equ 0002h
SMT1PRH_SMT1PR10_POSITION                equ 0002h
SMT1PRH_SMT1PR10_SIZE                    equ 0001h
SMT1PRH_SMT1PR10_LENGTH                  equ 0001h
SMT1PRH_SMT1PR10_MASK                    equ 0004h
SMT1PRH_SMT1PR11_POSN                    equ 0003h
SMT1PRH_SMT1PR11_POSITION                equ 0003h
SMT1PRH_SMT1PR11_SIZE                    equ 0001h
SMT1PRH_SMT1PR11_LENGTH                  equ 0001h
SMT1PRH_SMT1PR11_MASK                    equ 0008h
SMT1PRH_SMT1PR12_POSN                    equ 0004h
SMT1PRH_SMT1PR12_POSITION                equ 0004h
SMT1PRH_SMT1PR12_SIZE                    equ 0001h
SMT1PRH_SMT1PR12_LENGTH                  equ 0001h
SMT1PRH_SMT1PR12_MASK                    equ 0010h
SMT1PRH_SMT1PR13_POSN                    equ 0005h
SMT1PRH_SMT1PR13_POSITION                equ 0005h
SMT1PRH_SMT1PR13_SIZE                    equ 0001h
SMT1PRH_SMT1PR13_LENGTH                  equ 0001h
SMT1PRH_SMT1PR13_MASK                    equ 0020h
SMT1PRH_SMT1PR14_POSN                    equ 0006h
SMT1PRH_SMT1PR14_POSITION                equ 0006h
SMT1PRH_SMT1PR14_SIZE                    equ 0001h
SMT1PRH_SMT1PR14_LENGTH                  equ 0001h
SMT1PRH_SMT1PR14_MASK                    equ 0040h
SMT1PRH_SMT1PR15_POSN                    equ 0007h
SMT1PRH_SMT1PR15_POSITION                equ 0007h
SMT1PRH_SMT1PR15_SIZE                    equ 0001h
SMT1PRH_SMT1PR15_LENGTH                  equ 0001h
SMT1PRH_SMT1PR15_MASK                    equ 0080h

